Tekla Open API Reference for Tekla Structures 2025
Distance.FromDecimalString Method
Overload List
Name | Description
FromDecimalString(String)
 Creates a distance from a decimal string representation.
FromDecimalString(String, IFormatProvider)
 Creates a distance from a decimal string representation.
FromDecimalString(String, IFormatProvider, Distance.UnitType)
 Creates a distance from a decimal string representation.
Top
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace